000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийПоСтрокамСостояние/КомментарийПоСтрокамСостояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарийПоСтрокамСостояние</name>
  <resources>
    <name>НепрочтенныеЦентр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НепрочтенныеМагазин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийПоСтрокамСостояние/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписьКомментария(СтруктураСосотояния, ОднаЗапись = Ложь) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Документ.Установить(СтруктураСосотояния.Документ);
	НаборЗаписей.Прочитать();
			
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Документ = СтруктураСосотояния.Документ;

	Иначе
		
		НоваяЗапись = НаборЗаписей[0];
	
	КонецЕсли;
	
	НоваяЗапись.НепрочтенныеМагазин = НоваяЗапись.НепрочтенныеМагазин + СтруктураСосотояния.ДобавилМагазин - СтруктураСосотояния.ПрочиталМагазин;
	НоваяЗапись.НепрочтенныеЦентр = НоваяЗапись.НепрочтенныеЦентр + СтруктураСосотояния.ДобавилЦентр - СтруктураСосотояния.ПрочиталЦентр;

	НаборЗаписей.Записать();

КонецПроцедуры

Функция СтруктураСосотояния() Экспорт 
	
	СтруктураСосотояния = Новый Структура;
	СтруктураСосотояния.Вставить("Документ");
	СтруктураСосотояния.Вставить("ПрочиталЦентр", 0);
	СтруктураСосотояния.Вставить("ДобавилЦентр", 0);
	СтруктураСосотояния.Вставить("ПрочиталМагазин", 0);
	СтруктураСосотояния.Вставить("ДобавилМагазин", 0);
	
	Возврат СтруктураСосотояния;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
